OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1574.h
#define _PWM2OFCON_PWM2OFS0     0x01
#define _PWM2OFCON_OFS0         0x01
#define _PWM2OFCON_PWM2OFS1     0x02
#define _PWM2OFCON_OFS1         0x02
#define _PWM2OFCON_OFO          0x10
#define _PWM2OFCON_PWM2OFMC     0x10
#define _PWM2OFCON_PWM2OFM0     0x20
#define _PWM2OFCON_OFM0         0x20
#define _PWM2OFCON_PWM2OFM1     0x40
#define _PWM2OFCON_OFM1         0x40

//==============================================================================

extern __at(0x0DB1) __sfr PWM3PH;

//==============================================================================
//        PWM3PHL Bits

extern __at(0x0DB1) __sfr PWM3PHL;

typedef struct
  {
  unsigned PWM3PHL0             : 1;
  unsigned PWM3PHL1             : 1;
  unsigned PWM3PHL2             : 1;
  unsigned PWM3PHL3             : 1;
  unsigned PWM3PHL4             : 1;
  unsigned PWM3PHL5             : 1;
  unsigned PWM3PHL6             : 1;
  unsigned PWM3PHL7             : 1;
  } __PWM3PHLbits_t;

extern __at(0x0DB1) volatile __PWM3PHLbits_t PWM3PHLbits;

#define _PWM3PHL0               0x01
#define _PWM3PHL1               0x02
#define _PWM3PHL2               0x04
#define _PWM3PHL3               0x08
#define _PWM3PHL4               0x10
#define _PWM3PHL5               0x20
#define _PWM3PHL6               0x40
#define _PWM3PHL7               0x80

//==============================================================================


//==============================================================================
//        PWM3PHH Bits

extern __at(0x0DB2) __sfr PWM3PHH;

typedef struct
  {
  unsigned PWM3PHH0             : 1;
  unsigned PWM3PHH1             : 1;
  unsigned PWM3PHH2             : 1;
  unsigned PWM3PHH3             : 1;
  unsigned PWM3PHH4             : 1;
  unsigned PWM3PHH5             : 1;
  unsigned PWM3PHH6             : 1;
  unsigned PWM3PHH7             : 1;
  } __PWM3PHHbits_t;

extern __at(0x0DB2) volatile __PWM3PHHbits_t PWM3PHHbits;

#define _PWM3PHH0               0x01
#define _PWM3PHH1               0x02
#define _PWM3PHH2               0x04
#define _PWM3PHH3               0x08
#define _PWM3PHH4               0x10
#define _PWM3PHH5               0x20
#define _PWM3PHH6               0x40
#define _PWM3PHH7               0x80

//==============================================================================

extern __at(0x0DB3) __sfr PWM3DC;

//==============================================================================
//        PWM3DCL Bits

extern __at(0x0DB3) __sfr PWM3DCL;

typedef struct
  {
  unsigned PWM3DCL0             : 1;
  unsigned PWM3DCL1             : 1;
  unsigned PWM3DCL2             : 1;
  unsigned PWM3DCL3             : 1;
  unsigned PWM3DCL4             : 1;
  unsigned PWM3DCL5             : 1;
  unsigned PWM3DCL6             : 1;
  unsigned PWM3DCL7             : 1;
  } __PWM3DCLbits_t;

extern __at(0x0DB3) volatile __PWM3DCLbits_t PWM3DCLbits;

#define _PWM3DCL0               0x01
#define _PWM3DCL1               0x02
#define _PWM3DCL2               0x04
#define _PWM3DCL3               0x08
#define _PWM3DCL4               0x10
#define _PWM3DCL5               0x20
#define _PWM3DCL6               0x40
#define _PWM3DCL7               0x80

//==============================================================================


//==============================================================================
//        PWM3DCH Bits

extern __at(0x0DB4) __sfr PWM3DCH;

typedef struct
  {
  unsigned PWM3DCH0             : 1;
  unsigned PWM3DCH1             : 1;
  unsigned PWM3DCH2             : 1;
  unsigned PWM3DCH3             : 1;
  unsigned PWM3DCH4             : 1;
  unsigned PWM3DCH5             : 1;
  unsigned PWM3DCH6             : 1;
  unsigned PWM3DCH7             : 1;
  } __PWM3DCHbits_t;

extern __at(0x0DB4) volatile __PWM3DCHbits_t PWM3DCHbits;

#define _PWM3DCH0               0x01
#define _PWM3DCH1               0x02
#define _PWM3DCH2               0x04
#define _PWM3DCH3               0x08
#define _PWM3DCH4               0x10
#define _PWM3DCH5               0x20
#define _PWM3DCH6               0x40
#define _PWM3DCH7               0x80

//==============================================================================

extern __at(0x0DB5) __sfr PWM3PR;

//==============================================================================
//        PWM3PRL Bits

extern __at(0x0DB5) __sfr PWM3PRL;

typedef struct
  {
  unsigned PWM3PRL0             : 1;
  unsigned PWM3PRL1             : 1;
  unsigned PWM3PRL2             : 1;
  unsigned PWM3PRL3             : 1;
  unsigned PWM3PRL4             : 1;
  unsigned PWM3PRL5             : 1;
  unsigned PWM3PRL6             : 1;
  unsigned PWM3PRL7             : 1;
  } __PWM3PRLbits_t;

extern __at(0x0DB5) volatile __PWM3PRLbits_t PWM3PRLbits;

#define _PWM3PRL0               0x01
#define _PWM3PRL1               0x02
#define _PWM3PRL2               0x04
#define _PWM3PRL3               0x08
#define _PWM3PRL4               0x10
#define _PWM3PRL5               0x20
#define _PWM3PRL6               0x40
#define _PWM3PRL7               0x80

//==============================================================================


//==============================================================================
//        PWM3PRH Bits

extern __at(0x0DB6) __sfr PWM3PRH;

typedef struct
  {
  unsigned PWM3PRH0             : 1;
  unsigned PWM3PRH1             : 1;
  unsigned PWM3PRH2             : 1;
  unsigned PWM3PRH3             : 1;
  unsigned PWM3PRH4             : 1;
  unsigned PWM3PRH5             : 1;
  unsigned PWM3PRH6             : 1;
  unsigned PWM3PRH7             : 1;
  } __PWM3PRHbits_t;

extern __at(0x0DB6) volatile __PWM3PRHbits_t PWM3PRHbits;

#define _PWM3PRH0               0x01
#define _PWM3PRH1               0x02
#define _PWM3PRH2               0x04
#define _PWM3PRH3               0x08
#define _PWM3PRH4               0x10
#define _PWM3PRH5               0x20
#define _PWM3PRH6               0x40
#define _PWM3PRH7               0x80

//==============================================================================

extern __at(0x0DB7) __sfr PWM3OF;

//==============================================================================
//        PWM3OFL Bits

extern __at(0x0DB7) __sfr PWM3OFL;

typedef struct
  {
  unsigned PWM3OFL0             : 1;
  unsigned PWM3OFL1             : 1;
  unsigned PWM3OFL2             : 1;
  unsigned PWM3OFL3             : 1;
  unsigned PWM3OFL4             : 1;
  unsigned PWM3OFL5             : 1;
  unsigned PWM3OFL6             : 1;
  unsigned PWM3OFL7             : 1;
  } __PWM3OFLbits_t;

extern __at(0x0DB7) volatile __PWM3OFLbits_t PWM3OFLbits;

#define _PWM3OFL0               0x01
#define _PWM3OFL1               0x02
#define _PWM3OFL2               0x04
#define _PWM3OFL3               0x08
#define _PWM3OFL4               0x10
#define _PWM3OFL5               0x20
#define _PWM3OFL6               0x40
#define _PWM3OFL7               0x80

//==============================================================================


//==============================================================================
//        PWM3OFH Bits

extern __at(0x0DB8) __sfr PWM3OFH;

typedef struct
  {
  unsigned PWM3OFH0             : 1;
  unsigned PWM3OFH1             : 1;
  unsigned PWM3OFH2             : 1;
  unsigned PWM3OFH3             : 1;
  unsigned PWM3OFH4             : 1;
  unsigned PWM3OFH5             : 1;
  unsigned PWM3OFH6             : 1;
  unsigned PWM3OFH7             : 1;
  } __PWM3OFHbits_t;

extern __at(0x0DB8) volatile __PWM3OFHbits_t PWM3OFHbits;

#define _PWM3OFH0               0x01
#define _PWM3OFH1               0x02
#define _PWM3OFH2               0x04
#define _PWM3OFH3               0x08
#define _PWM3OFH4               0x10
#define _PWM3OFH5               0x20
#define _PWM3OFH6               0x40
#define _PWM3OFH7               0x80

//==============================================================================

