OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1574.h
#define PWM1LDS0                PWM1LDCONbits.PWM1LDS0          // bit 0, shadows bit in PWM1LDCONbits
#define LDS0                    PWM1LDCONbits.LDS0              // bit 0, shadows bit in PWM1LDCONbits
#define PWM1LDS1                PWM1LDCONbits.PWM1LDS1          // bit 1, shadows bit in PWM1LDCONbits
#define LDS1                    PWM1LDCONbits.LDS1              // bit 1, shadows bit in PWM1LDCONbits
#define LDT                     PWM1LDCONbits.LDT               // bit 6, shadows bit in PWM1LDCONbits
#define PWM1LDM                 PWM1LDCONbits.PWM1LDM           // bit 6, shadows bit in PWM1LDCONbits
#define LDA                     PWM1LDCONbits.LDA               // bit 7, shadows bit in PWM1LDCONbits
#define PWM1LD                  PWM1LDCONbits.PWM1LD            // bit 7, shadows bit in PWM1LDCONbits

#define PWM1OFS0                PWM1OFCONbits.PWM1OFS0          // bit 0, shadows bit in PWM1OFCONbits
#define OFS0                    PWM1OFCONbits.OFS0              // bit 0, shadows bit in PWM1OFCONbits
#define PWM1OFS1                PWM1OFCONbits.PWM1OFS1          // bit 1, shadows bit in PWM1OFCONbits
#define OFS1                    PWM1OFCONbits.OFS1              // bit 1, shadows bit in PWM1OFCONbits
#define OFO                     PWM1OFCONbits.OFO               // bit 4, shadows bit in PWM1OFCONbits
#define PWM1OFMC                PWM1OFCONbits.PWM1OFMC          // bit 4, shadows bit in PWM1OFCONbits
#define PWM1OFM0                PWM1OFCONbits.PWM1OFM0          // bit 5, shadows bit in PWM1OFCONbits
#define OFM0                    PWM1OFCONbits.OFM0              // bit 5, shadows bit in PWM1OFCONbits
#define PWM1OFM1                PWM1OFCONbits.PWM1OFM1          // bit 6, shadows bit in PWM1OFCONbits
#define OFM1                    PWM1OFCONbits.OFM1              // bit 6, shadows bit in PWM1OFCONbits

#define PWM1OFH0                PWM1OFHbits.PWM1OFH0            // bit 0
#define PWM1OFH1                PWM1OFHbits.PWM1OFH1            // bit 1
#define PWM1OFH2                PWM1OFHbits.PWM1OFH2            // bit 2
#define PWM1OFH3                PWM1OFHbits.PWM1OFH3            // bit 3
#define PWM1OFH4                PWM1OFHbits.PWM1OFH4            // bit 4
#define PWM1OFH5                PWM1OFHbits.PWM1OFH5            // bit 5
#define PWM1OFH6                PWM1OFHbits.PWM1OFH6            // bit 6
#define PWM1OFH7                PWM1OFHbits.PWM1OFH7            // bit 7

#define PWM1OFL0                PWM1OFLbits.PWM1OFL0            // bit 0
#define PWM1OFL1                PWM1OFLbits.PWM1OFL1            // bit 1
#define PWM1OFL2                PWM1OFLbits.PWM1OFL2            // bit 2
#define PWM1OFL3                PWM1OFLbits.PWM1OFL3            // bit 3
#define PWM1OFL4                PWM1OFLbits.PWM1OFL4            // bit 4
#define PWM1OFL5                PWM1OFLbits.PWM1OFL5            // bit 5
#define PWM1OFL6                PWM1OFLbits.PWM1OFL6            // bit 6
#define PWM1OFL7                PWM1OFLbits.PWM1OFL7            // bit 7

#define PWM1PHH0                PWM1PHHbits.PWM1PHH0            // bit 0
#define PWM1PHH1                PWM1PHHbits.PWM1PHH1            // bit 1
#define PWM1PHH2                PWM1PHHbits.PWM1PHH2            // bit 2
#define PWM1PHH3                PWM1PHHbits.PWM1PHH3            // bit 3
#define PWM1PHH4                PWM1PHHbits.PWM1PHH4            // bit 4
#define PWM1PHH5                PWM1PHHbits.PWM1PHH5            // bit 5
#define PWM1PHH6                PWM1PHHbits.PWM1PHH6            // bit 6
#define PWM1PHH7                PWM1PHHbits.PWM1PHH7            // bit 7

#define PWM1PHL0                PWM1PHLbits.PWM1PHL0            // bit 0
#define PWM1PHL1                PWM1PHLbits.PWM1PHL1            // bit 1
#define PWM1PHL2                PWM1PHLbits.PWM1PHL2            // bit 2
#define PWM1PHL3                PWM1PHLbits.PWM1PHL3            // bit 3
#define PWM1PHL4                PWM1PHLbits.PWM1PHL4            // bit 4
#define PWM1PHL5                PWM1PHLbits.PWM1PHL5            // bit 5
#define PWM1PHL6                PWM1PHLbits.PWM1PHL6            // bit 6
#define PWM1PHL7                PWM1PHLbits.PWM1PHL7            // bit 7

#define PWM1PRH0                PWM1PRHbits.PWM1PRH0            // bit 0
#define PWM1PRH1                PWM1PRHbits.PWM1PRH1            // bit 1
#define PWM1PRH2                PWM1PRHbits.PWM1PRH2            // bit 2
#define PWM1PRH3                PWM1PRHbits.PWM1PRH3            // bit 3
#define PWM1PRH4                PWM1PRHbits.PWM1PRH4            // bit 4
#define PWM1PRH5                PWM1PRHbits.PWM1PRH5            // bit 5
#define PWM1PRH6                PWM1PRHbits.PWM1PRH6            // bit 6
#define PWM1PRH7                PWM1PRHbits.PWM1PRH7            // bit 7

#define PWM1PRL0                PWM1PRLbits.PWM1PRL0            // bit 0
#define PWM1PRL1                PWM1PRLbits.PWM1PRL1            // bit 1
#define PWM1PRL2                PWM1PRLbits.PWM1PRL2            // bit 2
#define PWM1PRL3                PWM1PRLbits.PWM1PRL3            // bit 3
#define PWM1PRL4                PWM1PRLbits.PWM1PRL4            // bit 4
#define PWM1PRL5                PWM1PRLbits.PWM1PRL5            // bit 5
#define PWM1PRL6                PWM1PRLbits.PWM1PRL6            // bit 6
#define PWM1PRL7                PWM1PRLbits.PWM1PRL7            // bit 7

#define PWM1TMRH0               PWM1TMRHbits.PWM1TMRH0          // bit 0
#define PWM1TMRH1               PWM1TMRHbits.PWM1TMRH1          // bit 1
#define PWM1TMRH2               PWM1TMRHbits.PWM1TMRH2          // bit 2
#define PWM1TMRH3               PWM1TMRHbits.PWM1TMRH3          // bit 3
#define PWM1TMRH4               PWM1TMRHbits.PWM1TMRH4          // bit 4
#define PWM1TMRH5               PWM1TMRHbits.PWM1TMRH5          // bit 5
#define PWM1TMRH6               PWM1TMRHbits.PWM1TMRH6          // bit 6
#define PWM1TMRH7               PWM1TMRHbits.PWM1TMRH7          // bit 7

#define PWM1TMRL0               PWM1TMRLbits.PWM1TMRL0          // bit 0
#define PWM1TMRL1               PWM1TMRLbits.PWM1TMRL1          // bit 1
#define PWM1TMRL2               PWM1TMRLbits.PWM1TMRL2          // bit 2
#define PWM1TMRL3               PWM1TMRLbits.PWM1TMRL3          // bit 3
#define PWM1TMRL4               PWM1TMRLbits.PWM1TMRL4          // bit 4
#define PWM1TMRL5               PWM1TMRLbits.PWM1TMRL5          // bit 5
#define PWM1TMRL6               PWM1TMRLbits.PWM1TMRL6          // bit 6
#define PWM1TMRL7               PWM1TMRLbits.PWM1TMRL7          // bit 7

#define PWM2DCH0                PWM2DCHbits.PWM2DCH0            // bit 0
#define PWM2DCH1                PWM2DCHbits.PWM2DCH1            // bit 1
#define PWM2DCH2                PWM2DCHbits.PWM2DCH2            // bit 2
#define PWM2DCH3                PWM2DCHbits.PWM2DCH3            // bit 3
#define PWM2DCH4                PWM2DCHbits.PWM2DCH4            // bit 4
#define PWM2DCH5                PWM2DCHbits.PWM2DCH5            // bit 5
#define PWM2DCH6                PWM2DCHbits.PWM2DCH6            // bit 6
#define PWM2DCH7                PWM2DCHbits.PWM2DCH7            // bit 7

